## 01

### [DataFrame 연산 - 1]
- 일대일 대응으로 인덱스가 동일한 원소들끼리 연산 수행
- DataFrame과 숫자데이터 연산 수행

In [3]:
# [1] 모듈 로딩
import pandas as pd
import numpy as np      # 빈 칸 의미 표현을 위해서 사용

In [8]:
# [2] 데이터 준비
data = {'A' : [98, 78, 100, 52],
        'B' : [90, 70, 10, 50]}

In [9]:
# [3] Dict 데이터 ==> DataFrame 형태 저장
df = pd.DataFrame(data)
df

     A   B
0   98  90
1   78  70
2  100  10
3   52  50

In [10]:
# [4] 연산 수행
# - 산술 연산
df * 3

     A    B
0  294  270
1  234  210
2  300   30
3  156  150

In [12]:
# - 비교 연산
df <= 10

       A      B
0  False  False
1  False  False
2  False   True
3  False  False

## 02

### [DataFrame 연산 - 2]
- 일대일 대응으로 인덱스가 동일한 원소들끼리 연산 수행
- DataFrame과 DataFrame 연산 수행

In [13]:
# [1] 모듈 로딩
import pandas as pd
import numpy as np      # 빈 칸 의미 표현을 위해서 사용

In [14]:
# [2] 데이터 준비
data = {'A' : [98, 78, 100, 52],
        'B' : [90, 70, 10, 50]}

In [18]:
# [3] Dict 데이터 ==> DataFrame으로 저장
df1 = pd.DataFrame(data)
df2 = df1 / 4

In [19]:
print(df1, df2, sep = '\n\n')

     A   B
0   98  90
1   78  70
2  100  10
3   52  50

      A     B
0  24.5  22.5
1  19.5  17.5
2  25.0   2.5
3  13.0  12.5

In [21]:
# [4] 연산 수행
# - 산술 연산
df1 - df2, df1 * df2

(      A     B
 0  73.5  67.5
 1  58.5  52.5
 2  75.0   7.5
 3  39.0  37.5,
         A       B
 0  2401.0  2025.0
 1  1521.0  1225.0
 2  2500.0    25.0
 3   676.0   625.0)

In [23]:
# - 비교 연산
df1 <= df2

       A      B
0  False  False
1  False  False
2  False  False
3  False  False

In [29]:
# [5] 연산 수행 => DataFrame과 Series
# - 산술 연산
# - 'A' 컬럼만 추출
sr1 = df1['A']
sr1

0     98
1     78
2    100
3     52
Name: A, dtype: int64

In [30]:
df2 + sr1

    A   B   0   1   2   3
0 NaN NaN NaN NaN NaN NaN
1 NaN NaN NaN NaN NaN NaN
2 NaN NaN NaN NaN NaN NaN
3 NaN NaN NaN NaN NaN NaN

In [41]:
# [방법1] SR ==> DF으로 변환
sr2 = sr1.to_frame()
sr2

     A
0   98
1   78
2  100
3   52

In [43]:
sr2 + df2

       A   B
0  122.5 NaN
1   97.5 NaN
2  125.0 NaN
3   65.0 NaN

In [44]:
df2.add(sr2, fill_value=0)

       A     B
0  122.5  22.5
1   97.5  17.5
2  125.0   2.5
3   65.0  12.5

In [50]:
# [방법2] Transpose(전치)
df1.T + sr1

     0    1    2    3
A  196  156  200  104
B  188  148  110  102

## 03

### [DataFrame 연산 - 3]
- 일대일 대응으로 인덱스가 동일한 원소들끼리 연산 수행
- 연산 수행 메서드 활용
- NaN에 대한 값 설정으로 연산 수행 가능해짐

In [59]:
# [1] 모듈 로딩
import pandas as pd
import numpy as np    # 빈 칸을 의미하는 표현법 사용 위해서

In [60]:
# [2] 데이터 준비
data = {'A' : [98, 78, np.NaN, 52],
        'B' : [90, 70, 10, 50]}

In [61]:
# [3] Dict 데이터 ==> DataFrame 형태로 저장
df1 = pd.DataFrame(data)
df1

      A   B
0  98.0  90
1  78.0  70
2   NaN  10
3  52.0  50

In [63]:
# [4] 연산 수행
# - DataFrame + 숫자
df1.add(5, fill_value=0)

       A   B
0  103.0  95
1   83.0  75
2    5.0  15
3   57.0  55

In [70]:
# - DataFrame + DataFrame
df1.add(df1 + 10, axis = 0)

       A    B
0  206.0  190
1  166.0  150
2    NaN   30
3  114.0  110

In [71]:
data2 = {'A' : [98, 78, 20, 52],
        'B' : [90, 70, 10, 50]}

df2 = pd.DataFrame(data2)
df2

    A   B
0  98  90
1  78  70
2  20  10
3  52  50

In [73]:
df1.add(df2, fill_value=0)

       A    B
0  196.0  180
1  156.0  140
2   20.0   20
3  104.0  100